/********************************************************
 *
 * AA分布式引擎（C++）
 * 
 * app应用程序框架
 * 
 * author: ygluu
 * 
 * 2025 国庆
 * 
 *******************************************************/

/********************************************************
 *   app框架是高度抽象的模块，基于app能实现更加丰富、强大、便捷的功能
 * 
 *      1、模块化核心框架
 *      2、每个线程有独立的对象空间（thread_local）
 *      3、还可以实现诸如：FileIO、HTTP、SQL-DB、定时器、网络线程模型、异步消息Request-Response等功能
 *      4、同时基于app框架可实现分布式的线程模型，如caller模块实现
 * 
 *******************************************************/

#pragma once

#include "aos.h"

AA_API void aapp_run();

namespace aapp
{
    inline void run()
    {
        aapp_run();
    }
}
